app/views/jobs/_contractor.html.haml

  Bids on this job
  - @job.recent_bids.each do |bid|
---
SELECT "bids".* FROM "bids"  WHERE "bids"."job_id" = $1  ORDER BY "bids"."created_at" DESC  [["job_id", 1]]

  %h4
    - if !@job.find_accepted_bid.reviews.where(review_for: 1).empty?
---
SELECT COUNT(*) FROM "bids"  WHERE "bids"."job_id" = $1 AND "bids"."accepted" = 't'  [["job_id", 2]]