app/views/users/_skills.html.haml

        =f.label skill.name
        =f.check_box skill.name, checked: @user.skills.include?(skill)
---
SELECT  1 AS one FROM "skills" INNER JOIN "user_skills" ON "skills"."id" = "user_skills"."skill_id" WHERE "user_skills"."user_id" = $1 AND "skills"."id" = 1 LIMIT 1  [["user_id", 41]]
SELECT "skills".* FROM "skills"