app/views/home/_contractor.html.haml

=render partial: 'no_skills' if @user.skills.length == 0
---
SELECT "skills".* FROM "skills" INNER JOIN "user_skills" ON "skills"."id" = "user_skills"."skill_id" WHERE "user_skills"."user_id" = $1  [["user_id", 41]]

    My open bids
    - @user.jobs_i_bid_on.each do |job|
---
SELECT "bids".* FROM "bids"  WHERE "bids"."contractor_id" = $1  [["contractor_id", 40]]