app/controllers/bids_controller.rb

INSERT INTO "bids" ("comment", "contractor_id", "created_at", "job_id", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comment", "copper"], ["contractor_id", 41], ["created_at", "2014-12-15 00:37:42.446282"], ["job_id", 1], ["price", 1000], ["updated_at", "2014-12-15 00:37:42.446282"]]
---
  def create
    @bid = Bid.new(bid_params)
    @bid.contractor_id = @user.id
    @bid.job_id = params[:job_id]
    @bid.accepted = false
    if @bid.save