app/controllers/home_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 42]]
---
  def set_user
    @user ||= User.find(session[:user_id])

SELECT "skills".* FROM "skills"
---
  def set_skills
    @skills = Skill.all