app/controllers/jobs_controller.rb

  def create
    @job = Job.new(job_params)

    #@job.property_id = params[:property_id]
    #@properties = Property.all
    respond_to do |format|
      if at_least_one_skill_selected? && @job.save
---
INSERT INTO "job_skills" ("created_at", "job_id", "skill_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-15 08:51:08.266763"], ["job_id", 2], ["skill_id", 1], ["updated_at", "2014-12-15 08:51:08.266763"]]

  def set_skills
    @skills = Skill.all
---
SELECT "skills".* FROM "skills"