app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.user_type = params[:user_type]
    if @user.save
---
INSERT INTO "users" ("address", "created_at", "email", "name", "password_digest", "phone_number", "updated_at", "user_type") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def set_skills
    @skills = Skill.all
---
SELECT "skills".* FROM "skills"